# Agregacion de datos por categoria

In [16]:
import numpy as np
import pandas as pd
import math

In [2]:
gender = ["Male","Female"]
income = ["Poor","Middle Class","Rich"]

In [7]:
n = 500

gender_data = []
income_data = []

for i in range(0,500):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [10]:
gender_data[1:10]

['Male', 'Male', 'Female', 'Male', 'Male', 'Male', 'Male', 'Male', 'Female']

In [9]:
income_data[1:10]

['Rich',
 'Poor',
 'Rich',
 'Middle Class',
 'Middle Class',
 'Middle Class',
 'Rich',
 'Rich',
 'Rich']

z -> N(0,1)

N(m.s) -> m + s * z

In [19]:
#z -> N(0,1)

#N(m.s) -> m + s * z

height = 160 + 30 * np.random.randn(n)
weight = 65 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.randn(n)

In [22]:
data = pd.DataFrame(
    {
        "Gender": gender_data,
        "Economic Status": income_data,
        "Height": height.astype(int),
        "Weight": weight.astype(int),
        "Age": age.astype(int),
        "Income": income
    }
)

In [23]:
data.head()

   Gender Economic Status  Height  Weight  Age        Income
0  Female    Middle Class     209      80   33  19736.906669
1    Male            Rich     169      74   28  19422.953467
2    Male            Poor     173      74   34  16153.546696
3  Female            Rich     144      41   23  15872.800361
4    Male    Middle Class     183      74   35  21716.649709

## Agrupacion de datos

In [25]:
grouped_gender = data.groupby("Gender")

In [31]:
grouped_gender.groups

{'Female': [0, 3, 9, 11, 13, 15, 16, 18, 19, 20, 26, 28, 30, 31, 32, 33, 34, 35, 39, 43, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 57, 60, 63, 65, 71, 72, 73, 76, 79, 80, 81, 91, 92, 94, 100, 101, 106, 107, 108, 109, 110, 111, 112, 115, 116, 117, 121, 122, 124, 126, 127, 131, 133, 137, 138, 139, 141, 142, 144, 148, 149, 150, 152, 153, 154, 155, 157, 159, 160, 163, 165, 166, 172, 173, 177, 181, 184, 186, 187, 188, 189, 191, 194, 196, 199, 200, 203, 204, 205, ...], 'Male': [1, 2, 4, 5, 6, 7, 8, 10, 12, 14, 17, 21, 22, 23, 24, 25, 27, 29, 36, 37, 38, 40, 41, 42, 44, 56, 58, 59, 61, 62, 64, 66, 67, 68, 69, 70, 74, 75, 77, 78, 82, 83, 84, 85, 86, 87, 88, 89, 90, 93, 95, 96, 97, 98, 99, 102, 103, 104, 105, 113, 114, 118, 119, 120, 123, 125, 128, 129, 130, 132, 134, 135, 136, 140, 143, 145, 146, 147, 151, 156, 158, 161, 162, 164, 167, 168, 169, 170, 171, 174, 175, 176, 178, 179, 180, 182, 183, 185, 190, 192, ...]}

In [32]:
for names, groups in grouped_gender:
    print(names)
    print(groups)

Female
     Gender Economic Status  Height  Weight  Age        Income
0    Female    Middle Class     209      80   33  19736.906669
3    Female            Rich     144      41   23  15872.800361
9    Female            Rich     106      77   13  21585.943600
11   Female            Poor     224       0    5  15683.309168
13   Female            Rich     174      86   57  19211.823641
..      ...             ...     ...     ...  ...           ...
489  Female    Middle Class     160     104   16  13823.415219
491  Female            Rich     110      65   52  22589.702187
492  Female            Poor     142      96   20  18981.963244
495  Female            Poor     169      59   41  19624.296511
497  Female            Poor     176      76   41  22903.989250

[240 rows x 6 columns]
Male
    Gender Economic Status  Height  Weight  Age        Income
1     Male            Rich     169      74   28  19422.953467
2     Male            Poor     173      74   34  16153.546696
4     Male    Middle Class     183      74   35  21716.649709
5     Male    Middle Class     138      89   16  12654.501905
6     Male    Middle Class     148      65   40  18067.814873
..     ...             ...     ...     ...  ...           ...
493   Male    Middle Class     112      57   27  15917.317667
494   Male    Middle Class     179      93   36  12962.962584
496   Male            Poor     171      29   21  17185.745862
498   Male            Rich     131      83   31  20117.058994
499   Male            Rich     209      63   46  25717.981985

[260 rows x 6 columns]

In [34]:
grouped_gender.get_group("Female").head(10)

    Gender Economic Status  Height  Weight  Age        Income
0   Female    Middle Class     209      80   33  19736.906669
3   Female            Rich     144      41   23  15872.800361
9   Female            Rich     106      77   13  21585.943600
11  Female            Poor     224       0    5  15683.309168
13  Female            Rich     174      86   57  19211.823641
15  Female    Middle Class     116      94   43  19261.490097
16  Female    Middle Class     152      89   40  12658.834097
18  Female            Poor     131      65   24  12504.813917
19  Female            Poor     157      31   38  18127.252513
20  Female    Middle Class     139      97   39  14954.185817

In [35]:
double_group = data.groupby(["Gender","Economic Status"])

In [36]:
len(double_group)

6

In [37]:
for names, groups in double_group:
    print(names)
    print(groups)

('Female', 'Middle Class')
     Gender Economic Status  Height  Weight  Age        Income
0    Female    Middle Class     209      80   33  19736.906669
15   Female    Middle Class     116      94   43  19261.490097
16   Female    Middle Class     152      89   40  12658.834097
20   Female    Middle Class     139      97   39  14954.185817
28   Female    Middle Class     154      75   15  13321.775720
..      ...             ...     ...     ...  ...           ...
466  Female    Middle Class     176      80   35  23655.420941
468  Female    Middle Class     202      53   48  17756.927093
472  Female    Middle Class     185      66   44  11341.464383
477  Female    Middle Class     210      11   30  18303.342465
489  Female    Middle Class     160     104   16  13823.415219

[87 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status  Height  Weight  Age        Income
11   Female            Poor     224       0    5  15683.309168
18   Female            Poor     131      65   24  12504.813917
19   Female            Poor     157      31   38  18127.252513
26   Female            Poor     138      15   30  14054.228770
30   Female            Poor     127     138   45  12575.548928
..      ...             ...     ...     ...  ...           ...
483  Female            Poor     163      84   40  16498.273664
487  Female            Poor     198      74   13  13452.647891
492  Female            Poor     142      96   20  18981.963244
495  Female            Poor     169      59   41  19624.296511
497  Female            Poor     176      76   41  22903.989250

[73 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status  Height  Weight  Age        Income
3    Female            Rich     144      41   23  15872.800361
9    Female            Rich     106      77   13  21585.943600
13   Female            Rich     174      86   57  19211.823641
32   Female            Rich     187      31   53  14468.672069
39   Female            Rich     122      81   33  16425.197793
..      ...             ...     ...     ...  ...           ...
462  Female            Rich     174      93   40  20145.881973
465  Female            Rich     208      74   28  19272.810313
476  Female            Rich     161     110   26  20436.117026
479  Female            Rich     209      88    1  22558.769883
491  Female            Rich     110      65   52  22589.702187

[80 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status  Height  Weight  Age        Income
4     Male    Middle Class     183      74   35  21716.649709
5     Male    Middle Class     138      89   16  12654.501905
6     Male    Middle Class     148      65   40  18067.814873
10    Male    Middle Class     133      28   26  16605.146565
12    Male    Middle Class     159      67   41  18303.133600
..     ...             ...     ...     ...  ...           ...
475   Male    Middle Class     172      83   24  14423.673770
482   Male    Middle Class     149      38   31  17082.282219
490   Male    Middle Class     154      66   24  19282.784512
493   Male    Middle Class     112      57   27  15917.317667
494   Male    Middle Class     179      93   36  12962.962584

[88 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status  Height  Weight  Age        Income
2     Male            Poor     173      74   34  16153.546696
14    Male            Poor     149      33   25  16990.703566
22    Male            Poor     155     111   32  17263.588053
37    Male            Poor     163      74   20  14618.615693
38    Male            Poor     131      87    3  18795.890100
..     ...             ...     ...     ...  ...           ...
481   Male            Poor      92      40    0  17660.598552
484   Male            Poor     182      70    9  22427.792298
485   Male            Poor     140     125   25  18131.729759
486   Male            Poor     232      57   28  23935.703345
496   Male            Poor     171      29   21  17185.745862

[80 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status  Height  Weight  Age        Income
1     Male            Rich     169      74   28  19422.953467
7     Male            Rich     136      88   28  20476.754120
8     Male            Rich     104      40   44  18444.713117
17    Male            Rich     148      52   12  23905.961599
21    Male            Rich     126      64   23  16953.920844
..     ...             ...     ...     ...  ...           ...
471   Male            Rich     171      27   39  21377.101762
478   Male            Rich     157      82   35  19284.625920
488   Male            Rich     201      72   51  11869.091007
498   Male            Rich     131      83   31  20117.058994
499   Male            Rich     209      63   46  25717.981985

[92 rows x 6 columns]